{
  "session_number": 4,
  "date": "2026-02-26",
  "title": "Ysgramor's Tomb: Purity Path Ignites",
  "gm": "Charlotte (ChatGPT GM)",
  "players_present": [
    "Cole"
  ],
  "characters_present": [
    "pc_elitrof_whitemane"
  ],
  "session_summary": "Elitrof led the cure party (Kodlak, Farkas, Vilkas) from Jorrvaskr to Ysgramor's Tomb. A Silver Hand kill-team ambushed the party at Nightgate Pass — Elitrof used Fire Breath (YOL) to break the ambush, advancing the mastery clock to 4/8. At the Tomb, the three Glenmoril Witch Heads were spent on Harbinger Flame cure rites: Kodlak, Vilkas, and Farkas were each cleansed of the beast blood. Wuuthrad was reforged and placed in Elitrof's hands. Kodlak privately signaled Elitrof as a future Harbinger candidate. The session closed at the Reliquary with the purity path formally ignited.",
  "key_events": [
    "Cure party departs Jorrvaskr at dawn: Elitrof, Kodlak, Farkas, Vilkas",
    "Nightgate Pass ambush: Silver Hand kill-team repelled; Fire Breath (YOL) used — mastery 4/8",
    "Map Case: Nightgate Pass Notes acquired from Silver Hand lieutenant",
    "Ysgramor's Tomb entered; draugr guardians navigated",
    "Kodlak's cure rite: wolf spirit banished; Kodlak cured",
    "Vilkas's cure rite: Elitrof defended his will; Vilkas landed finishing strike; cured",
    "Farkas's cure rite: wolf-spirit manifested and destroyed; Farkas cured",
    "Three Glenmoril Witch Heads spent — zero remaining",
    "Wuuthrad reforged at the Reliquary; Elitrof carries it",
    "Kodlak privately signals Elitrof as future Harbinger candidate (official naming deferred)",
    "Refresh corrected to 2 (milestone spend)"
  ],
  "npcs_encountered": [
    "Kodlak Whitemane — Harbinger; cured of beast blood; signals harbingership",
    "Farkas — shield-brother; wolf-spirit manifested and destroyed; cured",
    "Vilkas — shield-brother; Elitrof defended will; Vilkas landed finishing blow; cured",
    "Silver Hand kill-team (Nightgate Pass ambush; all dead)"
  ],
  "locations_visited": [
    "Whiterun (Jorrvaskr — departure)",
    "Nightgate Pass (ambush site)",
    "Ysgramor's Tomb (Winterhold) — Oath-Hall, Harbinger Flame, Reliquary"
  ],
  "quests_updated": [
    {
      "quest": "Companions: Kodlak Cure Chain",
      "status": "Completed"
    },
    {
      "quest": "Companions: Inner Circle Rites",
      "status": "Completed"
    },
    {
      "quest": "Companions: Purity Path Ignites",
      "status": "Active"
    }
  ],
  "loot_acquired": [
    "Wuuthrad (Reforged Legendary Waraxe) [Weapon:4; +3 Fight while wielding; +3 vs Mer; Ancient Fury 1/session]",
    "Map Case: Nightgate Pass Notes (Advantage: Know the Passes)"
  ],
  "experience_gained": 0,
  "fate_points_awarded": 0,
  "milestone": "Significant",
  "notes": "End-of-session state: Elitrof FP 3 (Refresh 2). Stress cleared; Mild consequence: Freshly Sealed Wound. Companions Trust 10/10 (Legend). Fire Breath Mastery 4/8. Elemental Fury Mastery 6/8. Become Ethereal Mastery 1/4. Silver Hand Vendetta 4/6. NPC trust clocks: Kodlak 6/6, Vilkas 6/6, Farkas 6/6, Skjor 4/6. Aela loyalty 45. Glenmoril Witch Heads 0 remaining. SIGNIFICANT MILESTONE: +1 skill advance pending (award for completing Kodlak Cure Chain + Inner Circle Rites).",
  "next_session_prep": [
    "Return to Jorrvaskr: Aela and Skjor reaction to cure news",
    "Silver Hand Vendetta at 4/6 — Jorrvaskr at risk if clock ticks to 5+",
    "Harbinger succession: Kodlak deferred; when does the formal naming happen?",
    "Thalmor Retaliation clock at 2/8 — witness pressure beat incoming",
    "Manage the Inner Circle divide: three cured, two still wolf-blooded"
  ],
  "milestone_spend": {
    "type": "Significant",
    "spent_on": [
      "Refresh corrected to 2 (was 1; milestone spend applied this session)",
      "Significant Milestone award: +1 Skill Advance (unspent; may be applied later when chosen)."
    ]
  }
}
