{
  "session_number": 3,
  "date": "2026-02-25",
  "title": "Road Ambush, Underforge Refusal, and Glenmoril Heads",
  "gm": "Charlotte (ChatGPT GM)",
  "players_present": ["Cole"],
  "characters_present": ["pc_elitrof_whitemane"],
  "session_summary": "Elitrof exited Dustman's Cairn at dawn with the Wuuthrad fragment, intercepted a Silver Hand road intimidation attempt (killing one and capturing two), then returned to Jorrvaskr where Skjor revealed the Inner Circle secret. Elitrof refused the beast blood on Sovngarde principle, swore the Oath of Silence, and pledged himself to Kodlak's cure-path. Using prisoner intel and a Harbinger-sanctioned strike plan, Elitrof led Farkas and Vilkas to the Glenmoril Coven, baited them at a bridge choke-point, and secured three witch heads including the Hagraven matron.",
  "key_events": [
    "Dustman's Cairn aftermath: Wuuthrad fragment recovered and carried home",
    "Road ambush: Silver Hand confronted; 1 killed, 2 captured; civilians rescued",
    "Underforge revealed: Circle secret learned; beast blood refused; Oath of Silence sworn",
    "Kodlak cure-chain: Elitrof swears the Oath of Ysgramor and commits to redemption path",
    "Strike team formed: Farkas and Vilkas included for Glenmoril mission",
    "Glenmoril raid: pincer tactic executed; 2 witches taken out by twins; matron executed by Elitrof under Elemental Fury",
    "Ritual components secured: Glenmoril Witch Head x3"
  ],
  "npcs_encountered": [
    "Kodlak Whitemane - Harbinger (adoptive father)",
    "Skjor - mentor; Underforge gatekeeper",
    "Aela the Huntress - witness in Underforge",
    "Farkas - shield-brother; Glenmoril raid",
    "Vilkas - shield-brother; Glenmoril raid",
    "Silver Hand hunters (road ambush; 2 captured, 1 dead)",
    "Glenmoril Coven witches (2 dead) and Hagraven matron (dead)"
  ],
  "locations_visited": [
    "Dustman's Cairn (exterior departure)",
    "Whiterun Hold roads (ambush site)",
    "Whiterun (Jorrvaskr / Underforge)",
    "Falkreath Hold (Glenmoril Coven approaches)",
    "Glenmoril Coven (bridge choke-point / ritual gate)"
  ],
  "quests_updated": [
    {"quest": "Companions: Proving Honor", "status": "Completed"},
    {"quest": "Companions: Inner Circle Rites", "status": "Completed (Refused Beast Blood)"},
    {"quest": "Companions: Kodlak Cure Path", "status": "Active"}
  ],
  "loot_acquired": [
    "Silver Greatsword (Weapon:2, Silvered) — taken from Silver Hand captain",
    "Glenmoril Witch Head x3 (Ritual Component)"
  ],
  "experience_gained": 0,
  "fate_points_awarded": 0,
  "milestone": "Major",
  "notes": "End-of-session state: Elitrof FP 3 (Refresh 1; keeps higher), stress cleared, mild consequence remains: 'Freshly Sealed Wound'. Circle secret known; Oath of Silence active. Oath of Ysgramor Purity Track at Level 1. Clocks: Silver Hand Vendetta 4/6; Thalmor Retaliation 2/8. Thu'um: Elemental Fury used in critical moment; apply mastery advancement per thuum_system.json. Branch choice: refused beast blood; oath path begins.",
  "next_session_prep": [
    "Return to Jorrvaskr with witch heads; begin cure-rite prep scene with Kodlak",
    "Determine whether prisoners are handed to guards, interrogated again, or retained by Companions",
    "Advance Thalmor witness pressure consequences if rumors spread",
    "Offer compel tied to Oath of Silence + Sovngarde honor vs Circle secrecy"
  ],
  "milestone_spend": {
    "type": "Major",
    "spent_on": [
      "Fight +1: Great (+4) -> Superb (+5) (Breakthrough)",
      "High Concept rename RESERVED: 'Harbinger Elitrof - The Warrior-Poet' (triggered on Harbinger appointment)"
    ]
  }
}
