{
  "pc_id": "pc_elitrof_whitemane",
  "pc_name": "Elitrof Whitemane",
  "appearance_revision": "2026-02-26_elitrof_wuuthrad_warlook_v2",
  "portrait_path": "docs/assets/pcs/elitrof_whitemane_session4.jpg",
  "recognition_tags": [
    "nord",
    "companions",
    "jorrvaskr",
    "warrior-poet",
    "wuuthrad",
    "harbinger-candidate",
    "steel-plate",
    "fur-mantle",
    "blue-sash",
    "circlet",
    "blond-hair",
    "battlefield-smoke",
    "moonlit-war",
    "talos-amulet",
    "skaal",
    "solstheim",
    "lord-stone"
  ],
  "first_impression_lines": {
    "neutral": [
      "Blond hair crowned by a war-circlet, a blue sash cut across steel plate, and a fur mantle that moves like a living shadow. He looks like a saga that decided to walk.",
      "There's smoke in his silhouette and certainty in his stance. The axe in his hands isn't just a weapon, it's a historical argument.",
      "A Companion by bearing, but not the easy kind. The kind who makes a room check its spine before speaking.",
      "Steel, fur, and moonlight. He carries himself like someone who has already survived the chapter people fear.",
      "His eyes track threats the way a commander tracks formations: calm, practiced, and a little too ready."
    ],
    "positive": [
      "That blue sash and circlet aren't vanity. They read like responsibility. Like he's learned to carry a hall on his shoulders.",
      "There's a steadiness to him that makes danger feel smaller. The kind of man you want at your side when the sky goes dark.",
      "He looks like Jorrvaskr's promise made flesh: strength, honor, and the will to stand between you and the worst."
    ],
    "negative": [
      "A war-circlet, a fur mantle, and an axe that looks too comfortable in his hands. He has the posture of a man who thinks the Old Way is the only way.",
      "That calm isn't peace. It's restraint. The kind that snaps when pushed and leaves bodies in its wake.",
      "He carries himself like a verdict, not a conversation. If he decides you're wrong, it might become fatal."
    ]
  },
  "conditional_first_impression_lines": [
    {
      "id": "thalmor_talos_trigger_v2",
      "if_npc_blob_any": ["thalmor", "justiciar"],
      "lines": {
        "negative": [
          "The Talos amulet and the war-circlet make a statement the Thalmor can taste. This man isn't hiding what he is.",
          "He looks like a battlefield sermon aimed directly at elven law."
        ],
        "neutral": [
          "His gaze hardens the instant he clocks Thalmor colors. Not fear. A decision."
        ]
      }
    },
    {
      "id": "companions_recognition_v2",
      "if_npc_blob_any": ["companions", "jorrvaskr"],
      "lines": {
        "positive": [
          "A shield-sibling's posture. The kind that says: if you fall, I carry you, and if you're hunted, I hunt back."
        ],
        "neutral": [
          "Companion discipline in the shoulders, Harbinger-fire in the eyes."
        ]
      }
    },
    {
      "id": "skaal_recognition_v2",
      "if_npc_blob_any": ["skaal", "solstheim"],
      "lines": {
        "positive": [
          "The fur mantle and the quiet respect in his eyes mark him as one of the Skaal's proven. Not by claim, by deed."
        ]
      }
    }
  ]
}
