{
  "quest_id": "companions_ria_bond_quest",
  "name": "Ria: The Right Fight",
  "type": "Faction Quest",
  "status": "Inactive",
  "giver": "Ria",
  "location": "Jorrvaskr and surrounding Whiterun Hold",
  "faction": "The Companions",
  "description": "Ria has been volunteering for every dangerous contract to prove herself, and the strain is starting to show. When a Silver Hand scout is spotted trailing her after a solo patrol, Elitrof must help Ria decide what kind of hero she actually wants to be — and survive the ambush the Silver Hand have prepared for her.",
  "prerequisites": ["companions_proving_honor", "take_up_arms"],
  "objectives": [
    {
      "description": "Discover that Ria has been taking solo contracts without Hall approval, trying to build her reputation quickly.",
      "status": "Pending",
      "optional": false
    },
    {
      "description": "Identify and confront the Silver Hand scout tailing Ria; extract information about the ambush site they've prepared.",
      "status": "Pending",
      "optional": false
    },
    {
      "description": "Accompany Ria to the ambush site and let her choose how to handle it — full attack, strategic withdrawal, or a trap of their own. Her decision determines her growth.",
      "status": "Pending",
      "optional": false
    }
  ],
  "rewards": {
    "experience": 0,
    "gold": 150,
    "items": ["Ria's Polishing Stone (flavor item; aspect: 'Gift of a Shield-Sister')"],
    "reputation": [
      { "target": "Ria", "change": "major_increase", "reason": "Helped her choose wisdom over recklessness.", "loyalty_change": 10 },
      { "target": "The Companions", "change": "minor_increase", "reason": "Strengthened a junior member and exposed a Silver Hand contact." }
    ],
    "romance_gate_unlocked": "ria_romance_available",
    "notes": "Loyalty increase of +10 unlocks Ria's romance gate (requires loyalty >= 80)."
  },
  "complications": [
    {
      "trigger": "If Aela the Huntress learns Ria was followed by Silver Hand, she will push to make this an offensive strike rather than a rescue — creating tension with Elitrof's approach.",
      "faction": "The Companions (Aela faction)"
    },
    {
      "trigger": "If the Purity Path is active, Njada will publicly question why Ria gets a personal escort mission when the Hall has larger concerns — creating friction that must be managed.",
      "faction": "The Companions (Njada friction)"
    }
  ],
  "consequences": {
    "success": "Ria learns that real heroism includes choosing the right fight. Her loyalty increases and she becomes a steadier, more strategic ally. The Silver Hand contact is eliminated or exposed.",
    "failure": "Ria is wounded in the ambush and loses confidence. Her loyalty does not increase. The Silver Hand scout reports back, escalating Silver Hand activity in Whiterun Hold."
  },
  "related_npcs": ["Ria", "Aela the Huntress", "Njada Stonearm"],
  "related_locations": ["Jorrvaskr", "Whiterun Hold outskirts"],
  "gm_notes": "This quest is Ria's coming-of-age moment. The key dramatic beat is not the fight — it's letting her make the call. If Elitrof takes over, Ria learns nothing. If Elitrof coaches her and steps back, she grows. Adjust Silver Hand strength to make the decision genuinely risky."
}
