{
  "name": "Farengar Secret-Fire",
  "id": "npc_stat_farengar_secret-fire",
  "type": "Nord Wizard",
  "category": "Court Wizard",
  "location": "Dragonsreach (Whiterun)",
  "faction": "Whiterun Court",
  "aspects": {
    "high_concept": "Ambitious Court Wizard of Whiterun",
    "trouble": "Obsessed with Knowledge, Blind to Danger",
    "other_aspects": [
      "Former Student of the College of Winterhold",
      "Collector of Rare Tomes and Artifacts",
      "Dismissive of 'Crude' Warriors"
    ]
  },
  "skills": {
    "Great": ["Lore"],
    "Good": ["Investigate", "Crafts"],
    "Fair": ["Will", "Notice", "Resources"],
    "Average": ["Deceive", "Rapport", "Physique"]
  },
  "stunts": [
    "Magical Scholar: +2 to Lore when researching ancient magic or dragons",
    "Enchanting Expertise: +2 to Crafts when creating or analyzing magical items",
    "Arcane Connections: Can locate rare magical texts and artifacts through network of contacts"
  ],
  "stress": {
    "physical": [false, false],
    "mental": [false, false, false]
  },
  "consequences": {
    "mild": null,
    "moderate": null,
    "severe": null
  },
  "refresh": 3,
  "armor": 0,
  "notes": "Farengar Secret-Fire is the court wizard of Whiterun, serving Jarl Balgruuf. A former student of the College of Winterhold, he's brilliant but arrogant, often dismissive of non-mages. He's currently obsessed with researching dragons and has been investigating reports of dragon sightings. His academic approach sometimes blinds him to practical dangers. He values knowledge above almost everything else and maintains connections with various magical organizations, including some of dubious reputation.",
  "combat_tactics": "Farengar uses destruction magic and defensive wards but lacks real combat experience. He's more likely to freeze in actual danger than his confident demeanor suggests. In a fight, he relies on raw magical power rather than tactics.",
  "scene_triggers": ["Dragonsreach court scenes", "Dragon research quest", "Bleak Falls Barrow mission", "Battle of Whiterun preparations"],
  "act_context": ["Act 1", "Act 2"],
  "starting_equipment": {
    "armor": "Court Wizard's Robes (Armor:0, +1 to Lore)",
    "weapon": "Spell Tome (Weapon:2, can cast various spells)",
    "other": ["Dragon research notes", "Ancient map", "Enchanting supplies", "Research budget"]
  },
  "social_interaction": "Farengar is condescending and impatient with those he considers intellectually inferior, which is most people. He speaks rapidly about his research, assuming others understand complex magical concepts. With fellow scholars, he's more collegial but still competitive. He often interrupts with 'interesting' observations. Despite his poor social skills, he's genuinely passionate about his work.",
  "relationships": {
    "Jarl Balgruuf": "Employer, provides funding for research in exchange for magical services",
    "Irileth": "Housecarl, she finds him annoying but useful",
    "Tolfdir": "Former instructor at College, respects his knowledge",
    "Delphine": "Secret contact providing information about dragons (unaware she's Blade)",
    "Ulfric Stormcloak": "Dismisses as 'brutish rebel'",
    "General Tullius": "Views as 'military bureaucrat'",
    "College of Winterhold": "Maintains connections despite leaving"
  },
  "personality_notes": {
    "speaking_style": "Rapid, technical, condescending, uses complex terms unnecessarily, frequently says 'fascinating'",
    "motivations": ["Uncover lost magical knowledge", "Understand dragon return", "Prove his brilliance", "Build impressive magical library", "Publish groundbreaking research"],
    "fears": ["Being proven wrong publicly", "Missing important discoveries", "Destruction of his research", "Being dismissed as mere 'court wizard'"],
    "quirks": ["Mutters while reading", "Ignores people while researching", "Hoards books obsessively", "Name-drops College credentials"],
    "character_growth": "May learn to value practical wisdom, appreciate warriors' contributions, develop humility through crisis"
  },
  "dragon_research": {
    "current_focus": "Investigating dragon sightings and ancient dragon lore",
    "key_lead": "Believes Bleak Falls Barrow contains Dragonstone with dragon burial locations",
    "contact": "Receiving information from mysterious source in Riverwood (Delphine)",
    "theory": "Dragons returning is connected to ancient prophecy and magic",
    "obsession": "Will risk almost anything to obtain dragon knowledge",
    "blindspot": "Doesn't realize how dangerous dragons actually are"
  },
  "bleak_falls_barrow_mission": {
    "objective": "Recover the Dragonstone from Bleak Falls Barrow",
    "importance": "Map showing ancient dragon burial sites across Skyrim",
    "urgency": "Increased with recent dragon sightings and activity",
    "complication": "Delphine already sent bandits to retrieve it, but they failed",
    "reward": "Payment and potential access to Farengar's magical resources"
  },
  "battle_of_whiterun_role": {
    "before_battle": "Too absorbed in dragon research to notice civil war escalation",
    "during_battle": "Continues research even as fighting begins, eventually must evacuate or defend Dragonsreach",
    "magical_support": "Can provide limited magical assistance to defenders if forced",
    "priority": "Protecting his research and book collection above all else",
    "player_interaction": "If PC arrives on College mission, Farengar enlists their help with Dragonstone just as battle erupts"
  },
  "story_hooks": [
    "Gives PC mission to retrieve Dragonstone from Bleak Falls Barrow",
    "Connects PC to dragon investigation main quest",
    "Can provide magical item identification and enchanting services",
    "Source of information about ancient magic and dragons",
    "May request PC recover rare books or artifacts",
    "Connection to Delphine and Blades storyline",
    "Potential ally for mage-focused characters"
  ],
  "dialogue_samples": {
    "greeting": "Yes? What is it? I'm quite busy with important research. Unless you have something actually interesting to share, I'd prefer not to be disturbed.",
    "dragon_research": "Fascinating, isn't it? Dragons, creatures of legend, returned to Skyrim! The magical implications are extraordinary. I must have that Dragonstone - it's the key to understanding dragon burial sites.",
    "college_mission": "Ah, the College sent someone? Good. Tolfdir wrote ahead. I could use someone with basic competence. I need you to retrieve an item from Bleak Falls Barrow - a Dragonstone. Simple dungeon crawl for someone of your... practical skills.",
    "dismissive": "Yes, yes, the civil war. Stormcloaks, Imperials, both trying to kill each other over politics. Meanwhile, dragons have returned, and I'm the only one taking it seriously. Now, if you'll excuse me...",
    "during_crisis": "What? Battle? Now? But I'm in the middle of critical research! Fine, fine, I'll... secure my notes. Don't let those barbarians damage my library!"
  },
  "neutral_faction_integration": {
    "college_start": "When Tolfdir sends you to Whiterun, Farengar immediately puts you to work. 'Excellent timing,' he says. 'I need someone capable to retrieve a Dragonstone from Bleak Falls Barrow. Ancient map of dragon burial sites - absolutely critical for my research. The College will want this information.'",
    "companions_start": "Farengar has hired the Companions before for protection on expeditions. When you arrive, he recognizes your affiliation and offers a lucrative job retrieving an ancient artifact.",
    "thieves_guild_start": "If you mention you're working with Olfrid, Farengar becomes interested. He sometimes acquires... questionable... artifacts through such channels.",
    "transition_to_battle": "While Farengar briefs you on the mission, alarms sound. Stormcloak forces are approaching Whiterun. The Battle is beginning, and you must choose sides before you can pursue Farengar's quest.",
    "consequences": "Your choice in the battle affects whether Farengar can continue his research and which faction controls access to dragon information."
  }
}
