{
  "name": "Torvar",
  "id": "npc_stat_torvar",
  "type": "Companion (Axe-Brother)",
  "category": "Ally",
  "location": "Jorrvaskr, Whiterun",
  "faction": "The Companions",
  "aspects": {
    "high_concept": "Boisterous Axe-Brother of the Mead Hall",
    "trouble": "Fights First, Thinks Later",
    "other_aspects": [
      "Loyal to the Hall Over Everything",
      "Laughs at Pain, Until It's Personal",
      "Hates the Silver Hand With a Hot, Dumb Passion",
      "A Good Heart Buried Under Loudness"
    ]
  },
  "skills": {
    "Great": [
      "Fight"
    ],
    "Good": [
      "Physique",
      "Provoke"
    ],
    "Fair": [
      "Athletics",
      "Notice",
      "Will"
    ],
    "Average": [
      "Rapport",
      "Survival",
      "Shoot"
    ]
  },
  "stunts": [
    "Brawler's Momentum: +2 to Fight if Torvar created an advantage this scene using Physique (grapples, shoves, breaking lines).",
    "Mead Hall Roar (Once/session): Use Provoke to Create an Advantage 'Shaken' on a group in his zone (opposed by Will).",
    "Hold the Line: +2 to Fight when defending a chokepoint or doorway."
  ],
  "stress": {
    "physical": [
      false,
      false,
      false
    ],
    "mental": [
      false,
      false
    ]
  },
  "consequences": {
    "mild": null,
    "moderate": null,
    "severe": null
  },
  "refresh": 2,
  "armor": 2,
  "notes": "Torvar is a classic hall-warrior: loud, brave, and prone to turning a plan into a brawl. Underneath the noise, he's fiercely loyal. His growth arc is learning to be useful beyond being a hammer: scouting, restraint, and leadership when the Hall needs discipline.",
  "combat_tactics": "Torvar opens with a Physique shove or grapple to create an advantage, then powers through with Brawler's Momentum. He is excellent in tight corridors and at chokepoints. His Mead Hall Roar can break grouped enemies' composure at the start of a scene. GMs should lean into his impulsiveness — he rushes forward without waiting, which can be a liability in ambushes.",
  "starting_equipment": {
    "armor": "Companion Armor, medium (Armor:2)",
    "weapon": "Steel Greatsword (Weapon:3)",
    "other": [
      "Throwing Axes x2 (flavor; Weapon:1 range)",
      "Trophy tooth on a cord"
    ]
  },
  "social_interaction": "Torvar is loud and uncomplicated in conversation — he talks too much, laughs too loud, and calls everyone 'brother' within minutes. He responds best to directness and shared physical hardship. He shuts down when faced with politics or manipulation. Use him for morale scenes and to voice simple-but-true observations the PC might have missed.",
  "relationships": {
    "Kodlak Whitemane": "Respects him; doesn't always understand his patience.",
    "Farkas": "Gets along well; sees him as 'the reliable one.'",
    "Vilkas": "Feels judged by him; tries to impress him via bravado.",
    "Aela the Huntress": "Half terrified, half infatuated with her ferocity.",
    "the player character": "Wants to be his 'right-hand brawler'; accepts leadership when framed as 'Hall Law.'"
  },
  "personality_notes": {
    "speaking_style": "Loud, joking, simple phrasing; gets serious instantly when someone bleeds.",
    "motivations": [
      "Protect the Hall's reputation",
      "Crush the Silver Hand",
      "Be remembered"
    ],
    "fears": [
      "Being useless in a 'thinking fight'",
      "Losing his brothers and being unable to stop it"
    ],
    "quirks": [
      "Calls everyone 'brother'",
      "Collects trophies he can't explain later",
      "Overestimates his stealth constantly"
    ]
  },
  "story_hooks": [
    "Torvar's bond quest starts when he learns Silver Hand are funded by a local patron.",
    "He can be the first to volunteer for 'dangerous distraction' roles.",
    "He becomes a morale engine in civil-war battles if trained into discipline."
  ],
  "gm_notes": "Torvar reads as comic relief but should never be played as useless. His loyalty is genuine and his rage at the Silver Hand is personal — the GM can reveal a dead shield-sibling in his past at the right moment. In combat he is a reliable damage engine; his weakness is cunning enemies who bait him out of position. His bond quest teaches him that loving the Hall means sometimes standing down."
}