{
  "id": "pc_elitrof_whitemane",
  "name": "Elitrof Whitemane",
  "player": "Cole",
  "race": "Nord",
  "class": "Companion (Neutral POV)",
  "standing_stone": "The Lord Stone",
  "portrait_path": "docs/assets/pcs/elitrof_whitemane.png",
  "aspects": {
    "high_concept": "Warrior-Poet of Jorvaskr",
    "high_concept_reserved": "Harbinger Elitrof - The Warrior-Poet",
    "high_concept_reserved_trigger": "Becomes official when Elitrof is formally named Harbinger by the Circle.",
    "trouble": "Righteously Protective, Ill-Tempered Man of Principle",
    "other_aspects": [
      "Nomadic Sage of Skyrim",
      "Adoptive Son of Kodlak Whitemane",
      "'Ole Great Bear' of the Skaal of Solstheim"
    ],
    "compel_library": {
      "trouble": [
        "Takes insults to his honor, shield-siblings, Kodlak, Skyrim, or the Skaal unkindly.",
        "Disdains those who disrespect Skyrim's culture, history, or way of life.",
        "Will stand up against the ban on Talos, especially when enforcement turns cruel.",
        "Quick to settle disputes the Old Way when pushed (honor challenge or deadly duel).",
        "Will not tolerate slights against the Skaal; treats them as personal."
      ],
      "aspects": {
        "Warrior-Poet of Jorvaskr": [
          "Can't resist turning a tense moment into a public verse, toast, or challenge.",
          "A chance to do something saga-worthy pulls him toward risk.",
          "Feels compelled to represent Jorrvaskr honorably in public."
        ],
        "Nomadic Sage of Skyrim": [
          "A rumor of a lost saga/site distracts him from the direct path.",
          "Stops to correct ignorance even when silence would be safer.",
          "Feels duty-bound to record or preserve lore."
        ],
        "Adoptive Son of Kodlak Whitemane": [
          "Someone speaks ill of Kodlak, and Elitrof takes it personally.",
          "Companions' needs override personal plans.",
          "Protects Kodlak's reputation even at cost."
        ],
        "'Ole Great Bear' of the Skaal of Solstheim": [
          "The 'bear' cloak draws questions that can expose the truth.",
          "Skaal trouble reaches him by rumor; he feels obligated to answer.",
          "Outsiders mocking Skaal custom triggers immediate pushback."
        ]
      }
    }
  },
  "skills": {
    "Superb (+5)": [
      "Fight"
    ],
    "Great (+4)": [
      "Physique"
    ],
    "Good (+3)": [
      "Athletics"
    ],
    "Fair (+2)": [
      "Command",
      "Lore",
      "Provoke"
    ],
    "Average (+1)": [
      "Notice",
      "Crafts",
      "Will",
      "Rapport"
    ]
  },
  "racial_bonuses": {
    "skill_bonuses": [
      "Fight (+1)",
      "Athletics (+1)"
    ],
    "notes": "Apply as effective +1 when relevant; does not break pyramid."
  },
  "stunts": [
    "Rake and Rend: When Elitrof Defends with Fight while dual-wielding and succeeds with style, he may forgo the boost to instead inflict 2 physical stress on the attacker. If he also spends 1 Fate Point, he may create the scene aspect 'Rending Blow' with 2 free invokes.",
    "Flyting Words: +2 to Provoke when insulting, jeering, or intimidating with sharp Nordic verse. On success with style, create the scene aspect 'Brutal Eloquence' with 1 free invoke.",
    "Lore Authority: +2 to Lore for Skyrim/Solstheim history/culture. May use Lore to Overcome as Rapport when persuasion is grounded in precedent, scholarship, or storytelling."
  ],
  "extras": {
    "pelt_ulran_vjarn": {
      "item_id": "pelt_ulran_vjarn",
      "level_current": 1,
      "level_max": 3,
      "cost": "1 Refresh (replaces Pack Tactics)"
    },
    "thuum": {
      "cost": "1 Refresh",
      "known_shouts": [
        {
          "name": "Elemental Fury",
          "words": [
            "Su",
            "Grah",
            "Dun"
          ],
          "words_unlocked": 3,
          "mastery_clock_id": "thuum_elemental_fury_mastery"
        },
        {
          "name": "Fire Breath",
          "words": [
            "Yol",
            "Toor",
            "Shul"
          ],
          "words_unlocked": 1,
          "mastery_clock_id": "thuum_fire_breath_mastery"
        },
        {
          "name": "Become Ethereal",
          "words": ["Feim", "Zii", "Gron"],
          "words_unlocked": 1,
          "mastery_clock_id": "thuum_become_ethereal_mastery"
        }
      ]
    },
    "oath_of_ysgramor": {
      "id": "oath_of_ysgramor",
      "level_current": 1,
      "level_max": 3,
      "source": "data/stunts/companions.json"
    }
  },
  "stress": {
    "physical": [
      false,
      false,
      false,
      false
    ],
    "mental": [
      false,
      false,
      false
    ]
  },
  "consequences": {
    "mild": "Freshly Sealed Wound",
    "moderate": null,
    "severe": null
  },
  "refresh": 2,
  "fate_points": 3,
  "gold": 2130,
  "equipment": [
    "Skyforge Steel Waraxe (Jorrvaskr) x2 [one etched with Ysgramor, one etched with a dragon]",
    "Companion-styled leather armor",
    "Alchemy Tools",
    "Scholar Log",
    "Amulet of Talos",
    "Harbinger's Horn Toggle (Emergency Call): Blow to summon a shield-brother response (once per mission; no shame to use, per Kodlak)",
    "Pelt of the Great Werebear Ulran-Vjarn (Artifact L1/3) — Skaal-blessed hide; worn as cloak/armor",
    "Alchemy Pouch",
    "Satchel",
    "Nord Mead (Bottle)",
    "Alchemical Draught: Berserker (Skaal Crimson Cut) x1 [remaining dose; refined in-field at the wolf den]",
    "Wuuthrad (Reforged Legendary Waraxe) [Weapon:4; +3 Fight while wielding; +3 vs Mer; Ancient Fury 1/session]",
    "Map Case: Nightgate Pass Notes (Advantage: Know the Passes)",
    "Rune-Etched Ancient Nord Torc (Hearth-Ward) — minor enchant, warmth vs cold",
    "Sapphire x1",
    "Garnet x1",
    "Potion: Vigorous Healing x1",
    "Silver Greatsword (Weapon:2, Silvered) — taken from Silver Hand captain",

    "Shield of Ysgramor (Legendary Shield Artifact) [Armor:3, Wall of the Five Hundred]"
  ],
  "relationships": {
    "kodlak_whitemane": "Adoptive father. Found Elitrof as the sole survivor of a shipwreck off the coast of Eastmarch while on mission. Suspects Elitrof's origins trace back to Solstheim and the Skaal. Taught him to fight, strategize, wield an axe, and tempered his rage into righteous purpose; fostered his love of history.",
    "skjor": "Pseudo-mentor and counterweight to Kodlak's approach. Gave Elitrof his first mead and drilled one creed: never be prey.",
    "farkas": "Childhood best friend and shield-sibling. Loyal, straightforward, quick to stand at Elitrof's side.",
    "vilkas": "Childhood best friend and shield-sibling. Disciplined, demanding; expects Elitrof to earn every ounce of his legend.",
    "vignar_greymane": "Grandfather-figure storyteller; stoked Elitrof's hunger for glory, reverence, and a name worth remembering."
  },
  "backstory": {
    "format": "personal_log",
    "entries": [
      {
        "day_count": 1823,
        "year": "4E 201",
        "date": "4th of Frostfall",
        "era": "Fourth Era",
        "location": "Skyrim road (recorded later)",
        "text": "(See Session Zero log entry for full text.)"
      },
      {
        "day_count": 1824,
        "year": "4E 201",
        "date": "5th of Frostfall",
        "era": "Fourth Era",
        "location": "Solstheim (recorded later)",
        "text": "(See Session Zero log entry for full text.)"
      }
    ]
  },
  "notes": "Neutral in the Civil War through the Companions. Kodlak found him shipwrecked off Eastmarch; suspects Skaal/Solstheim roots. Learned the Thu'um at High Hrothgar. Mentored by the Skaal; slew a legendary werebear and wears its hide as a cloak while downplaying it as 'just a bear.' Battle Cry used this session (wolf den). Used Elemental Fury (Su Grah Dun) at Pelagia Farm (unmastered; FP spent) to secure a solo giant takeout witnessed by Farkas. Also received Harbinger's Horn Toggle for Dustman's Cairn mission (emergency call for backup). GM NOTE: Elitrof NOW KNOWS the Inner Circle (including Kodlak) are werewolves; Skjor revealed the secret in the Underforge. Elitrof refused the beast blood on Sovngarde principle and swore the Oath of Silence. He has committed to Kodlak's cure-path and sworn the Oath of Ysgramor (Purity Track L1). Cleared Dustman's Cairn solo. Engaged Silver Hand defilers, recovered Wuuthrad fragment, and defeated a Draugr Overlord. Learned the Word Wall 'YOL' and used Fire Breath (unmastered; FP spent) in a critical duel. A Silver Hand survivor escaped. Milestones (x2 Minor): Retired Pack Tactics (Companion Drill) extra; promoted Ulran-Vjarn werebear pelt into Artifact Extra (L1/3) with Armor:2 and Hide of the Huntsman. Led Glenmoril raid with Farkas and Vilkas; secured 3 witch heads for cure rite. Major Milestone Spend (post-Session 3): Breakthrough raised Fight to Superb (+5). High Concept rename reserved: 'Harbinger Elitrof - The Warrior-Poet' (activate when named Harbinger). Session 4 (Ysgramor's Tomb): Discovered the Oath-Wall and learned FEIM (Become Ethereal) from the Word Wall; started mastery clock (1/4 with Oath discount). Recovered the Shield of Ysgramor from the Reliquary. Session 4 Closeout: Fire Breath mastery advanced to 4/8 after the Nightgate ambush (YOL). Glenmoril heads spent (Kodlak/Vilkas/Farkas cured). Wuuthrad reforged and carried by Elitrof.",
  "knowledge": {
    "companions_circle_knowledge_stage": "revealed_refused",
    "kodlak_reveal_policy": "forbade_until_time",
    "underforge_oath_silence": true
  }
}
