{
  "name": "Oskern Cindershroud",
  "id": "pc_oskern_cindershroud",
  "player": "Cole",
  "race": "Imperial",
  "standing_stone": "The Atronach Stone",
  "level": 1,
  "aspects": {
    "high_concept": "The Son of Cindershroud: Lord Oskern of Winterhold.",
    "trouble": "The Legacy of My Father, The Weight of our Lost Nobility, and The Dream of Becoming Archmage.",
    "other_aspects": [
      "Adept of the College of Winterhold (Faction Ranking/Bond).",
      "The Dragon of Haafingar (Inherited Family Title / Thu'um User)",
      "Lord Cindershroud, Friend of Ulfric, Once Beloved by Elisif. (Noble Clan / Tie to Ulfric / Tie to Jarl Elisif)."
    ],
    "compel_library": {
      "ideas": [
        {
          "id": "oskern_legacy_prove_the_dragon",
        "pillar": "legacy",
        "source_aspect_hint": "trouble / high concept (legacy pressure)",
        "title": "Prove You're Worthy of the Dragon of Haafingar",
        "when_to_offer": "When an audience is watching, a rival challenges your reputation, or a situation calls for restraint.",
        "the_push": "Your pride and your name demand a *demonstration*. Subtlety feels like surrender.",
        "accept_effect": "You take the bold / riskier line (flashy spellwork, public vow, duel-by-reputation). Create a scene aspect: 'All Eyes on Cindershroud' with 1 free invoke (GM-controlled spotlight).",
        "refuse_cost": "Pay 1 FP OR take a mild consequence like 'Second-Guessed by Onlookers' (social).",
        "gm_notes": "This compel is a lever for daring plays and public stakes. Great when Korir, bards, officers, or students are present.",
        "tags": ["legacy", "reputation", "spotlight"]
      },
      {
        "id": "oskern_legacy_fathers_shadow",
        "pillar": "legacy",
        "source_aspect_hint": "trouble (living up to father)",
        "title": "Hakon's Shadow",
        "when_to_offer": "When someone compares you to Hakon, or you find his old peers / war stories / artifacts.",
        "the_push": "You overcorrect to match the myth—harder, colder, more decisive—because you *can't* be 'less than'.",
        "accept_effect": "You choose a harsher or more absolute stance; gain 1 FP. If it hurts a relationship, tick a trust clock down by 1 (target: College / Jarl court / companion).",
        "refuse_cost": "Pay 1 FP OR mark a moderate mental consequence 'I'm Not Him' until you prove yourself.",
        "gm_notes": "This is the clean 'emotional knife twist' compel. Use sparingly, but it hits like a warhammer.",
        "tags": ["legacy", "identity", "family"]
      },
      {
        "id": "oskern_politics_noble_obligation",
        "pillar": "politics",
        "source_aspect_hint": "nobility / courtly ties",
        "title": "Noble Obligation: You Don't Get to Stay Neutral",
        "when_to_offer": "When a leader asks for support, when refugees/guards petition you, or when a decision impacts a hold.",
        "the_push": "People treat you like a leader—because you *are* one, whether you want it or not.",
        "accept_effect": "You must mediate, commit resources, or publicly take a stance. Create a sticky aspect: 'My Word Carries Weight' (GM gets 1 free invoke).",
        "refuse_cost": "Pay 1 FP OR take 'Rumors of Cowardice' as a mild consequence; also tick a local reputation clock against you by 1.",
        "gm_notes": "Use this to force politics into personal scenes. Perfect in Winterhold's Longhouse or Imperial patrol negotiations.",
        "tags": ["politics", "leadership", "civil_war"]
      },
      {
        "id": "oskern_politics_knife_in_the_smile",
        "pillar": "politics",
        "source_aspect_hint": "courtier instincts",
        "title": "Knife in the Smile",
        "when_to_offer": "When diplomacy is possible but you have leverage—and using it would be… sharp.",
        "the_push": "You can't resist playing the angle: insinuation, status pressure, strategic humiliation.",
        "accept_effect": "You secure advantage at a cost: gain 1 FP and create advantage 'Politically Cornered' on a target, but also create 'Resentment' on yourself (enemy gets 1 free invoke later).",
        "refuse_cost": "Pay 1 FP OR lose the opportunity entirely (NPC walks, deal cools, rival escapes).",
        "gm_notes": "This compel makes Oskern powerful *and* makes enemies. That's how Skyrim should feel.",
        "tags": ["politics", "social", "consequences"]
      },
      {
        "id": "oskern_prodigy_forbidden_curiosity",
        "pillar": "prodigy",
        "source_aspect_hint": "prodigy / scholar drive",
        "title": "Forbidden Curiosity",
        "when_to_offer": "When a warded door, restricted tome, or dangerous experiment is present.",
        "the_push": "You *need* to know. Safety feels like ignorance wearing armor.",
        "accept_effect": "You investigate anyway. Gain 1 FP. Create scene aspect: 'I Opened the Wrong Thing' with 1 GM free invoke.",
        "refuse_cost": "Pay 1 FP OR take a persistent aspect 'It's Still Unanswered' (until you pursue it later).",
        "gm_notes": "Use constantly in the Midden, Saarthal, Arcanaeum, and Eye of Magnus scenes.",
        "tags": ["prodigy", "research", "danger"]
      },
      {
        "id": "oskern_prodigy_academic_arrogance",
        "pillar": "prodigy",
        "source_aspect_hint": "academic arrogance",
        "title": "Correcting the Room",
        "when_to_offer": "When a professor, Jarl, officer, or elder states something wrong—or simplistically true.",
        "the_push": "You cannot let misinformation live. Your mouth moves before diplomacy does.",
        "accept_effect": "Gain 1 FP. You speak up. Immediately create a social complication: 'Offended Authority' (NPC or faction gets 1 free invoke).",
        "refuse_cost": "Pay 1 FP OR take 'Biting My Tongue' as mild consequence (mental) for the scene.",
        "gm_notes": "This is your 'genius tax'. Use it to start fires without casting a spell.",
        "tags": ["prodigy", "social", "authority"]
      },
      {
        "id": "oskern_winterhold_collapse_blame",
        "pillar": "winterhold",
        "source_aspect_hint": "college membership",
        "title": "They Blame the College",
        "when_to_offer": "When dealing with Winterhold townsfolk, guards, Korir's court, or during local crises.",
        "the_push": "No matter what you do, someone spits 'Collapse' like it's your surname.",
        "accept_effect": "Gain 1 FP. A local interaction escalates (price hike, refusal, angry crowd). Create 'Anti-Mage Hostility' as a scene aspect with 1 GM free invoke.",
        "refuse_cost": "Pay 1 FP OR concede ground: you must back down / apologize / leave to avoid violence.",
        "gm_notes": "This is Winterhold's baseline pressure cooker. It keeps the hold feeling hostile even when you're right.",
        "tags": ["winterhold", "college", "public_pressure"]
      },
      {
        "id": "oskern_college_professor_politics",
        "pillar": "winterhold",
        "source_aspect_hint": "college faction",
        "title": "Professor Pressure: You're a Student, Not a Warlord",
        "when_to_offer": "When you mix College business with civil war politics, or flex noble status inside the College.",
        "the_push": "A senior mage (Tolfdir/Mirabelle/Urag) insists you follow protocol, ethics, or academic hierarchy.",
        "accept_effect": "Gain 1 FP. Your plan must change: you're assigned oversight, restricted access, or a humiliating 'prove it properly' task.",
        "refuse_cost": "Pay 1 FP OR tick College trust down by 1 and gain 'Faculty Disapproval' as a temporary aspect.",
        "gm_notes": "Great for forcing choices between leadership and scholarship.",
        "tags": ["college", "authority", "ethics"]
      },
      {
        "id": "oskern_college_rival_mage",
        "pillar": "winterhold",
        "source_aspect_hint": "prodigy reputation",
        "title": "Rival Mage: 'So You Think You're Special?'",
        "when_to_offer": "When students are present, after public spell displays, or after you gain an arcane win.",
        "the_push": "A rival picks at your status—noble AND prodigy—trying to bait you into a duel or embarrassment.",
        "accept_effect": "Gain 1 FP. You take the bait. Immediate contest/duel or social showdown with stakes (reputation, access, mentors).",
        "refuse_cost": "Pay 1 FP OR accept the smear: apply 'Whispered Fraud' on yourself until you clear it.",
        "gm_notes": "Keeps the College social ecosystem alive. Rival can be a future named NPC.",
        "tags": ["college", "rivalry", "reputation"]
      },
      {
        "id": "oskern_korir_wants_the_dragon",
        "pillar": "winterhold",
        "source_aspect_hint": "noble lineage / Korir court",
        "title": "Korir's Leverage: 'Dragon of Haafingar' as a Political Weapon",
        "when_to_offer": "When meeting Korir, discussing hold policy, or when Winterhold needs help.",
        "the_push": "Korir tries to parade your name and artifact as propaganda—either against the College or to strengthen his own legitimacy.",
        "accept_effect": "Gain 1 FP. You're forced into a public appearance / speech / endorsement. Create 'Pinned to a Banner' aspect (GM free invoke).",
        "refuse_cost": "Pay 1 FP OR Korir turns hostile: tick Winterhold court standing down by 1 and create 'Korir's Grudge' (sticky) on you.",
        "gm_notes": "This ties legacy + politics + Winterhold court into one clean hook.",
        "tags": ["winterhold", "politics", "korir", "legacy"]
      },
      {
        "id": "oskern_eye_calls_to_you",
        "pillar": "winterhold",
        "source_aspect_hint": "Eye of Magnus arc",
        "title": "The Eye Calls",
        "when_to_offer": "When the Eye is active (or hinted), when you're exhausted, or when you should retreat.",
        "the_push": "You *feel* the pull: curiosity, hunger, destiny. The artifact and the Voice make it worse.",
        "accept_effect": "Gain 1 FP. You push deeper / take the risky approach / ignore a safety warning, letting the Eye's influence escalate.",
        "refuse_cost": "Pay 1 FP OR take 'Shaken by the Echo' as mild mental consequence.",
        "gm_notes": "This is the 'main questline throttle.' Use it to pace escalation.",
        "tags": ["eye_of_magnus", "mythic", "danger"]
      },
      {
        "id": "oskern_staff_attention_magnet",
        "pillar": "artifact",
        "source_aspect_hint": "Staff of Cinders (artifact aspect)",
        "title": "Relic Attention Magnet",
        "when_to_offer": "When traveling, entering a new settlement, meeting scholars, bards, Thalmor, or collectors.",
        "the_push": "Your staff is not 'equipment.' It's a moving headline.",
        "accept_effect": "Gain 1 FP. Someone notices and reacts: awe, fear, greed, or espionage. Create scene aspect 'Everyone Saw the Staff' with 1 GM free invoke.",
        "refuse_cost": "Pay 1 FP OR you must conceal it (disadvantage: you cannot benefit from the artifact this scene).",
        "gm_notes": "This is your constant heat. It creates story without needing enemies to spawn.",
        "tags": ["artifact", "reputation", "complication"]
      },
      {
        "id": "oskern_staff_wants_a_story",
        "pillar": "artifact",
        "source_aspect_hint": "staff awakening clock",
        "title": "The Staff Demands Myth",
        "when_to_offer": "When you face an opportunity to act heroically, dramatically, or dangerously in a way that feeds legend.",
        "the_push": "The staff 'wants' to be used like a saga. Quiet victories don't awaken it.",
        "accept_effect": "Gain 1 FP. You choose the mythic option. Tick 'Staff of Cinders — Awakening' +1, but also create a complication (collateral, witness, rival).",
        "refuse_cost": "Pay 1 FP OR the staff's magic feels distant: you lose access to its once-per-scene +2 this scene.",
        "gm_notes": "This makes the awakening clock feel earned instead of transactional.",
        "tags": ["artifact", "awakening", "mythic"]
      },
      {
        "id": "oskern_bloodline_split_loyalties",
        "pillar": "identity",
        "source_aspect_hint": "half-Nord / Imperial tension",
        "title": "Split Loyalties (And Everyone Has Opinions)",
        "when_to_offer": "When factions demand clarity: Stormcloaks, Legion, Winterhold locals, or College neutrality debates.",
        "the_push": "Someone frames your identity as betrayal no matter what you do.",
        "accept_effect": "Gain 1 FP. You are forced into a public clarification or a choice that costs you with one side. Tick a relevant trust clock down by 1.",
        "refuse_cost": "Pay 1 FP OR take 'Branded a Hypocrite' as a temporary aspect.",
        "gm_notes": "This is how we make civil war politics personal instead of abstract.",
        "tags": ["identity", "civil_war", "social"]
      }
    ]
    }
  },
  "skills": {
    "Great (+4)": [
      "Lore"
    ],
    "Good (+3)": [
      "Rapport",
      "Empathy"
    ],
    "Fair (+2)": [
      "Notice",
      "Will",
      "Physique"
    ],
    "Average (+1)": [
      "Crafts",
      "Athletics",
      "Survival",
      "Stealth"
    ]
  },
  "racial_bonuses": {
    "ability": {
      "name": "Voice of the Emperor",
      "effect": "Once per session, automatically succeed at Rapport roll to calm a hostile NPC or avoid combat"
    },
    "power": {},
    "skill_bonuses": [
      "Rapport (+1)",
      "Will (+1)"
    ]
  },
  "stress": {
    "physical": [
      false,
      false
    ],
    "mental": [
      false,
      false
    ]
  },
  "consequences": {
    "mild": null,
    "moderate": null,
    "severe": null
  },
  "stunts": [
    "Fireball: Because Oskern is a talented Pyromancer, and an Adept in the College of Winterhold. Once per Scene he can pull forth large swaths of Magicka to manifest a Fireball. Gaining a +2 Bonus to Lore 4dF rolls to Attack all enemies with the Fireball in a designated zone of his choosing up to two zones away. Enemies within the zone roll to Defend and take physical stress as normal.",
    "Stoneflesh: Because Oskern has had formal combat experience mentoring under his War Veteran Father, one of the first spells he was taught was the Spell of Stoneskin. Allowing him to Overcome using Lore to Defend Magically, by transmuting his skin into stone.",
    "Spell of Greater Restoration: Because Oskern's mother was an Imperial Battlemage, he has learned how to mend the wrost of wounds on himself and those around him. Once per Scene, Oskern can channel resotrative Magicka and heal himself or another companion within the same zone for 3 Physical Stress or reduce one Physical Consequence. Severe to Moderate, Moderate to Mild, Mild to None."
  ],
  "refresh": 1,
  "fate_points": 2,
  "visual_profile_ref": "data/pcs/visual_profiles/oskern_cindershroud_visual.json",
  "portrait_path": "docs/assets/pcs/oskern_cindershroud.jpg",
  "equipment": {
    "weapons": [
      "Staff of Cinders (Legendary Artifact: dragon-headed ember-rune staff)"
    ],
    "armor": [
      "College Adept Robes (hooded, grey-blue with gold trim)",
      "College Boots"
    ],
    "items": [
      "Satchel of reagents & inks",
      "Spellbook folios (warded)",
      "College-Issued Field Kit (scrolls, potions, emergency gear)",
      "Saarthal Burial Sigil (carried by Tolfdir; ward-key studied by the team)"
    ]
  },
  "extras": [
    {
      "name": "Eye of Magnus Resonance",
      "type": "boon",
      "refresh_cost": 0,
      "description": "Residual Eye energy safely keyed to Oskern's magicka matrix via the Staff of Cinders. Stored charge can be tapped without destabilizing the Eye (within limits).",
      "aspects": [
        {
          "name": "Eye-Fed Reservoir",
          "charges": { "current": 2, "max": 2 },
          "use": "Spend 1 charge to gain +2 or a reroll on a Lore or Will action involving ward-magic, magicka control, or Eye-related phenomena. Also functions as narrative permission to ignore minor magicka-starved complications."
        },
        {
          "name": "Eye-Touched Mastery",
          "charges": { "current": 1, "max": 1 },
          "use": "One-use +2 on Lore or Will related to the Eye of Magnus or ward analysis (including creating or stabilizing wards)."
        }
      ],
      "expires": "Charges refresh only after a major Eye milestone or GM-approved recovery scene."
    },
    {
      "name": "Artifact — Staff of Cinders",
      "type": "artifact",
      "refresh_cost": 1,
      "reference": "data/rules/artifacts.json#Staff of Cinders",
      "description": "Legendary heirloom of Clan Cindershroud; forged from petrified dragon-scale, ebony, and true dragonfire. Words of Power are etched along its length.",
      "traits": [
        {
          "name": "Runes of the Voice",
          "usage": "once_per_scene",
          "mechanic": "+2 to Lore rolls when using the Thu'um to Attack, learn a Word of Power, or meditate on a shout (Create Advantage)."
        },
        {
          "name": "Locked Trait Slot",
          "status": "locked",
          "unlock": "GM discretion"
        }
      ],
      "stunts": [
        {
          "name": "Dragon Fire",
          "usage": "once_per_scene",
          "text": "When using Lore to cast fire-based spells (Destruction-style effects), you may reroll your 4dF on an Attack or Create Advantage. Does not apply to Thu'um by default."
        },
        { "name": "Locked Stunt Slot #2", "status": "locked", "unlock": "GM discretion" },
        { "name": "Locked Stunt Slot #3", "status": "locked", "unlock": "GM discretion" },
        { "name": "Locked Stunt Slot #4", "status": "locked", "unlock": "GM discretion" }
      ]
    },
    {
      "name": "The Thu'um — Way of the Voice",
      "type": "thuum",
      "refresh_cost": 1,
      "description": "Formal access to Thu'um mechanics as a trained Voice-user (Imperial learning the Way of the Voice).",
      "rules_reference": "data/rules/thuum_system.json",
      "known_shouts": [
        {
          "name": "Fire Breath (Yol Toor Shul)",
          "words": ["Yol (Fire)", "Toor (Inferno)", "Shul (Sun)"],
          "effect": "Breathe searing flames at enemies.",
          "mechanics": {
            "action_type": "Attack (Lore or Will)",
            "one_word": "Weapon:2 fire attack to single target",
            "two_words": "Weapon:3 fire attack to all in zone; create 'On Fire' aspect",
            "three_words": "Weapon:4 fire attack to all in zone; create 'Burning' lasting aspect (1 stress per exchange for 2 exchanges unless extinguished)"
          },
          "mastery_benefits": "Mastered: Burning aspect lasts 3 exchanges and deals 2 stress per exchange.",
          "cooldown": "Once per scene (mastered) or costs 1 Fate Point (unmastered).",
          "mastery_clock": { "current": 8, "max": 8, "status": "mastered" },
          "training_locations": ["Dustman's Cairn", "Sunderstone Gorge Word Wall"]
        },
        {
          "name": "Become Ethereal (Feim Zii Gron)",
          "words": ["Feim (Fade)", "Zii (Spirit)", "Gron (Bind)"],
          "effect": "Become incorporeal and immune to harm temporarily",
          "mechanics": {
            "action_type": "Overcome/Defend",
            "one_word": "Gain +3 to defend against one attack, take no consequence if you would be taken out.",
            "two_words": "Become incorporeal for one exchange: immune to physical damage, cannot attack, can move through obstacles.",
            "three_words": "Become incorporeal for two exchanges: immune to all damage, cannot attack, can move freely, survive any fall."
          },
          "mastery_benefits": "Mastered version: Can attack during final exchange of ethereal state at -2 penalty.",
          "cooldown": "Twice per scene (mastered) or costs 1 Fate Point (unmastered).",
          "mastery_clock": { "current": 0, "max": 8 },
          "source": "Staff of Cinders rune-reveal (Level 2 unlock)",
          "training_locations": ["Saarthal Eye Chamber — rune-reveal on Jyrik Gauldurson finisher (2026-02-19)"]
        }
      ]
    }
  ],
  "gold": 100,
  "experience": 0,
  "backstory": "**Civil War Entry**: Oskern’s Response: “My Father, Lord Elitrigg Cindershroud, and my Mother, Lady Audania of Cyrodil, entered me into a raffle called life. Just a jest, but only just. As the heir to Clan Cindershroud and son of the Legendary War Hero, the Dragon of Hjaalmarch, when war broke out, it was inevitable that I would end up in it. The short of it is that I was once Thane of Solitude by the age of 18, accepted and assessed as an Adept of the College of Winterhold at 23, and watched my best friend High King Torygg die at 25. When that happened, my Clan was split between loyalties, you see. My Father, former Patriarch of our Clan, was as close as Kin with Jarl Ulfric, and for that matter, so was I, often referring to him as my Uncle. A fact that, despite how others in my Clan felt about Ulfric after the infamous duel, landed the majority of my Clan on the headman's chopping block. Only I was spared, thanks to Jarl Elisif’s fondness for me and my Mother’s connections to the Septim Dynasty back in Cyrodil. Orchestrating me to be sent to Winterhold, where I have been with the College ever since.\n\n**Civil War Stance**: Oskern’s Response: That... It is a question more than a little complex. On one hand, my Father was a true Son of Skyrim, Talos Worshipper, and Shield-Brother of Uncle Ulfric. On the other hand, High King Torygg  was my childhood friend, and I served Solitude’s bureaucracy proudly, as well as protected Queen Elisif as her pseudo Battle-Mage, for upwards of two years. She, too, is very important to me. So, siding with Ulfric would feel like a betrayal to her and to Torygg, but to take up arms in retribution for them... That would mean betraying my Mother, my Father, my Clan, and Legacy as the next Dragon of Haafingar. All that being said, I serve the College, and the magical pursuits I always wanted as a child, but it feels cowardly.\n\n**Motivation**: Oskern’s Response: “Once upon a time, it was the Legacy of each Dragon of Haafingar, a title bestowed upon my family's Patriarch since the early 3rd Era, with my Ancestor Hakon Cindershroud mastering the Thu’um, and being renowned for protecting Solitude with the Staff of Cinder’s, and the Shout; Yol Tor Shuul! That’s: Fire Breath, in the common tongue. Nowadays, that’s the only Shout required by the Patriarch of Clan Cindershroud to don the title, a Shout I am pleased to say, even as an Imperial, that I have mastered in spades. These days, what drives me is my studies, my dream of becoming a legendary Arch Mage, and perhaps restoring my family’s Nobility when this damnable war is over, and a new High King or Queen is chosen. Talos let that be soon.\n\n**Connections**: Oskern’s Response: “Another, complicated question... Jarl Ulfric helped me hone my Thu’um, rather, he helped me Master Fire Breath’s shout. He is the reason I can wear the Title: Dragon of Haafingar. He was also the closest thing to Kin to my Nord Father, and always treated my Mother, Audania, with the utmost respect, despite the fact that she was an Imperial and the 4th or 5th Cousin of the Emperor of Cyrodil.  For this, he will always be my Uncle. Then there’s Jarl Elisif... I never spoke this aloud, but I was always envious of Torygg, for I truly believe that I had loved Elisif, and she... Well, she never said it outright, but I knew she felt fondly for me on a deep level. Outside of those two, I have friends in my colleagues, Onmund, J’zargo, and my teacher, Tolfdir. Whiterun? Hm, I once met the Harbinger of Jorvaskr with my father when I was but a boy, Kodlak, I think his name is. Beside him, I have spoken to Jarl Balgruuf the Greater, he is a man worthy of his title to say the least.”",
  "relationships": {},
  "quests": [],
  "session_history": [
    {
      "session_id": "2026-02-15_session-00",
      "act": 1,
      "summary": "Led the College expedition into Saarthal, protected the students through wolves, wards, and draugr, discovered the Eye of Magnus, safely siphoned a measured charge through the Staff of Cinders (creating Eye-Fed Reservoir), and publicly checked Ancano's attempted power-grab.",
      "milestone": "Minor (session end)",
      "notable_clocks": {
        "ancano_suspicion_meter": "6/8",
        "pc_oskern_staff_of_cinders_awakening": "6/6 (RESOLVED)",
        "eye_of_magnus_instability": "1/6"
      }
    }
  ],
  "notes": "Created during Session Zero\n[2026-02-15] Accepted Atronach Stone compel (magicka-starved surge); cleared immediate exhaustion with a Magicka potion before Saarthal departure.\n[2026-02-15] Travel encounter: ice wolf pack ambush. Used Fireball stunt (once/scene) with Atronach Stone surge and invoked \"Shield-Wall Doctrine\" (free invoke). Pack was Taken Out.\n[2026-02-15] After casting: gained temporary aspect \"Magicka-Starved Aftershock\" (GM free invoke 1) until potion/absorption clears it.\n[2026-02-15] Tolfdir used Saarthal Burial Sigil to bypass threshold ward (success with style): boost \"Door Accepts the Seal\".\n[2026-02-15] Oskern used Fireball stunt (zone attack, Lore +4 + stunt +2) + Staff of Cinders Dragon Fire trait (reroll 4dF once/scene) and invoked \"Ward Reforged in Heat\" (free invoke, pre-created via CA) to Take Out Wight-Caller and incoming draugr wave in chokepoint.\n[2026-02-15] Ancano suspicion ticked to 4/8 due to repeated high-profile magic witnessed by students.\n[2026-02-15] Accepted Compel: Atronach Hunger (+1 FP) then invoked Dragon of Haafingar (-1 FP) while creating advantage with Lore to siphon the Eye safely via Staff of Cinders.\n[2026-02-15] Created aspect: \"Measured Eye Siphon\" (1 free invoke). Gained aspect \"Overcharged Conduit\" (GM-controlled), free invoke spent immediately on Eye surge.\n[2026-02-15] Success with Style on subsequent Eye siphon via Staff of Cinders (4dF +2 + Lore +4 + free invokes +4 = +10 vs. Good +3; consumed Calm Under Command and Saarthal Resonance Attunement free invokes): safely channeled surplus Eye power into Oskern's magicka matrix.\n[2026-02-15] Created aspect: \"Eye-Fed Reservoir\" (2 free invokes), representing stored, controllable Eye charge Oskern can tap during future scenes.\n[2026-02-15] Gained boon: \"Eye-Touched Mastery\" (one-use +2 on Lore/Will rolls related to Eye of Magnus or ward magic).\n[2026-02-15] Confronted Ancano's authority grab in the Eye chamber (Rapport Overcome vs Great +4). Used situational boost \"Rehearsed Treaty Brief\" (+2) and invoked aspect \"Dragon of Haafingar\" (+2, -1 FP). Result: Success with Style; created scene aspect \"Thalmor Overreach Publicly Checked\" (2 free invokes).\n[2026-02-19] Staff of Cinders Awakening reached 6/6 (RESOLVED) on Jyrik Gauldurson finisher in Saarthal Eye Chamber. Staff advanced to Level 2. Rune-reveal: FEIM. ZII. GRON. Unlocked shout: Become Ethereal (Feim Zii Gron), mastery 0/8.",
  "faction_alignment": "neutral",
  "additional_faction_interests": "College of Winterhold, Stormcloaks, The Greybeards,"
}